Revit 2024 API
BuiltInFailures.EditingFailures.CannotMoveInView Property
 Can't move element because the move plane is seen at a very sharp angle in this View
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotMoveInView { get; }
Visual Basic
Public Shared ReadOnly Property CannotMoveInView As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotMoveInView {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.EditingFailures Class
Autodesk.Revit.DB Namespace